import { uid } from 'uid';

export const questionsData = [
  {
    title:
      'Чому мені варто довіряти діагностиці, якщо я вже маю власні способи справлятися з проблемами?',
    description:
      'Ваші власні методи можуть бути ефективними, але діагностика від психолога допоможе вам краще зрозуміти, чи є вони дійсно достатніми. Можливо, ви відкриєте для себе нові способи подолання труднощів, які ще більше покращать ваше самопочуття.',
    isOpen: true,
    id: uid(),
  },
  {
    title:
      'Я не люблю говорити про свої особисті проблеми. Чи можу я пройти діагностику, якщо мені некомфортно ділитися всім?',
    description:
      'Ви можете ділитися лише тим, що вважаєте за потрібне. Діагностика не змушує вас розповідати про все. Психолог буде поважати ваші межі і допоможе працювати з тим, що ви готові обговорювати.',
    isOpen: true,
    id: uid(),
  },
  {
    title:
      'Що робити, якщо я відчуваю страх або соромлюсь звернутися до психолога?',
    description:
      'Це нормальні відчуття. Психолог надасть вам безпечний простір для відкритого спілкування, де ви зможете поділитися своїми переживаннями без осуду.',
    isOpen: true,
    id: uid(),
  },
  {
    title:
      'Що робити, якщо я не відчуваю проблем, але інші кажуть, що мені потрібна допомога?',
    description:
      'Часом ми не усвідомлюємо власних проблем, і саме зворотний зв’язок від оточення може бути важливим сигналом. Діагностика допоможе вам зрозуміти, чи дійсно є щось, що потребує уваги, і чи потрібно щось змінювати у своєму житті.',
    isOpen: true,
    id: uid(),
  },
  {
    title: 'Чи зможу я отримати допомогу у вирішенні конкретних проблем?',
    description:
      'Так, під час діагностики психолог допоможе визначити корінь ваших проблем та запропонує шляхи їх вирішення. Однак для глибшого опрацювання може знадобитися подальша терапія.',
    isOpen: true,
    id: uid(),
  },
  {
    title: 'Які результати я отримаю після діагностики?',
    description:
      'Після діагностики ви отримаєте професійну оцінку вашого емоційного стану, а також рекомендації щодо подальших кроків для покращення самопочуття та вирішення проблем.',
    isOpen: true,
    id: uid(),
  },
  {
    title: 'Я боюся, що розкриття своїх проблем може погіршити мій стан.',
    description:
      'Психолог працює для того, щоб підтримати вас і допомогти знайти способи подолання труднощів. Діагностика проводиться в обстановці, де ви почуватиметесь комфортно, і спеціаліст буде діяти максимально делікатно, щоб не погіршити ваш стан.',
    isOpen: true,
    id: uid(),
  },
  {
    title:
      'У мене немає серйозних проблем, лише легкий стрес. Навіщо тоді проходити діагностику?',
    description:
      'Легкий стрес може накопичуватися і переростати в щось більше, якщо його не контролювати. Діагностика допоможе зрозуміти, як цей стрес впливає на вас зараз і як його можна зменшити, щоб він не перетворився на серйозну проблему.',
    isOpen: true,
    id: uid(),
  },
  {
    title:
      'Я не впевнений, що мені варто довіряти свої особисті проблеми незнайомій людині.',
    description:
      'Психолог дотримується  строгих правил конфіденційності та етики. Він створює безпечний простір, де ви можете відкрито обговорювати свої проблеми без страху, що вас засудять або розкриють вашу інформацію.',
    isOpen: true,
    id: uid(),
  },
  {
    title:
      'Що робити, якщо мені здається, що мої проблеми ніхто не зможе зрозуміти?',
    description:
      'Це нормальне відчуття, але психологи мають досвід роботи з найрізноманітнішими проблемами і можуть запропонувати новий погляд на вашу ситуацію. Вони допоможуть вам відчути себе почутим і зрозумілим.',
    isOpen: true,
    id: uid(),
  },
];
